publish/make-svg-map-outline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-28 Sat 01:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>制作SVG地图轮廓</title>
<meta name="author" content="Spike Leung" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">制作SVG地图轮廓</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge5ebd87">前言</a></li>
<li><a href="#orgced534a">获取 GIS 数据</a></li>
<li><a href="#orgb6fea2e">截取需要的地图轮廓</a></li>
<li><a href="#orgb96b3f9">简化地图</a></li>
<li><a href="#org2fa3e92">导出时增加信息</a></li>
<li><a href="#orga078fee">参考链接</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge5ebd87" class="outline-2">
<h2 id="orge5ebd87">前言</h2>
<div class="outline-text-2" id="text-orge5ebd87">
<p>
由于项目基于 AmMap，有时需要使用中国某些省份或者市区作为地图，但是 AmMap 没有提供相关的地图数据，官网提供了一个自制地图数据的文档，
根据此文档，只要有地图的 GIS 数据，就可以制作出想要的地图。
</p>
</div>
</div>
<div id="outline-container-orgced534a" class="outline-2">
<h2 id="orgced534a">获取 GIS 数据</h2>
<div class="outline-text-2" id="text-orgced534a">
<p>
网上搜索下载相关地区的 GIS 数据，一般下载下来会包含 <code>.shp</code> , <code>.shx</code>, <code>.prj</code>, <code>.dbf</code> 等类型的文件， 这里提供一份<a href="https://www.ganghe.net/research/data/china-gis-data">中国地图的 GIS 数据</a>。
</p>
</div>
</div>
<div id="outline-container-orgb6fea2e" class="outline-2">
<h2 id="orgb6fea2e">截取需要的地图轮廓</h2>
<div class="outline-text-2" id="text-orgb6fea2e">
<p>
获取轮廓，可以使用这个工具 <a href="https://github.com/mbloch/mapshaper">mapshaper</a>, 具体步骤如下:
</p>

<ol class="org-ol">
<li>把 GIS 数据导入到 <code>mapshaper</code> 中，如果是下载了上文的中国地图 GIS 数据，里面包含了 <code>1</code> ， <code>2</code> ， <code>3</code> 不同精度的地图，根据需要的精度导入，
笔者开发的时候，需要淄博市的轮廓，于是就导入等级 <code>3</code> 的地图数据</li>

<li>打开 console，通过命令获得需要的轮廓
<ul class="org-ul">
<li><code>filter 'NAME_1 == "Shandong" &amp;&amp; NAME_2 == "Zibo" &amp;&amp; NAME_3 != "Gaoqing" || NAME_3 == "Zouping"'</code> 过滤得到淄博的轮廓</li>
<li><code>mapshaper -clean</code> 清除淄博以外的区域</li>
<li>由于不需要轮廓里面的线，只需要最外面那层轮廓，将里面的线移除:
<ul class="org-ul">
<li><code>mapshaper -dissolve</code></li>
<li><code>mapshaper -clean</code></li>
</ul></li>
</ul></li>
<li>导出成 SVG 数据，到此已经得到一个淄博地图轮廓的 SVG 了</li>
<li>由于要在 AmMap 里用，使用 AmMap 提供的<a href="http://extra.amcharts.com/mapparser3/">工具</a>， 获取 JSON 数据，这里获取的 JSON 数据就能用于 AmMap 了
<ul class="org-ul">
<li>打开导出的 SVG 文件，复制里面 <code>&lt;g&gt;</code> 标签的全部内容</li>
<li>导入到 <a href="http://extra.amcharts.com/mapparser3/">mapparser3</a>，获取到 JSON 数据</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgb96b3f9" class="outline-2">
<h2 id="orgb96b3f9">简化地图</h2>
<div class="outline-text-2" id="text-orgb96b3f9">
<p>
  如果下载的地图数据很精细，导出时可能会导出一个非常大的文件，但是太大的文件又可能不好处理，
这时，可以利用 mapshaper 的 <code>Simplify</code> 的功能去简化地图，从而导出一个大小合适的地图。
</p>
</div>
</div>
<div id="outline-container-org2fa3e92" class="outline-2">
<h2 id="org2fa3e92">导出时增加信息</h2>
<div class="outline-text-2" id="text-org2fa3e92">
<p>
一般 GIS 数据里包含了很多地图区域的信息，例如，东莞市这个区域，包含了这块区域是什么市，属于什么省份等信息，
但是当导出 SVG 的时候，发现这些信息丢失了。可以通过在导出的时候，指定要包含的属性，这样导出的SVG就能够包含
相关的属性信息了。简单的用法：
</p>
<ul class="org-ul">
<li>在 mapshaper 的右上角又一个 <code>i</code> 的按钮，点开此按钮有一个 <code>data</code> 选项，选择此选项后，悬浮在地图区域的时候
就能看到此区域的相关属性信息</li>
<li>例如属性信息当中有一个 <code>id</code> 属性，那么当点击右上角 <code>Export</code> 的时候，在弹窗中有一个可以输入 <code>export options</code>
的输入框，可以输入 <code>-o svg-data=id</code>, 然后导出，导出的 SVG 中就会包含一个 <code>data-id</code> 的属性值。</li>
</ul>
</div>
</div>
<div id="outline-container-orga078fee" class="outline-2">
<h2 id="orga078fee">参考链接</h2>
<div class="outline-text-2" id="text-orga078fee">
<ul class="org-ul">
<li><a href="https://www.amcharts.com/docs/v3/tutorials/creating-custom-maps-for-javascript-ammap/">Creating custom maps for JavaScript amMap(AmMap3)</a></li>
<li><a href="https://www.amcharts.com/docs/v4/tutorials/creating-custom-maps/">Creating custom maps(AmMap4)</a></li>
<li><a href="https://www.ganghe.net/research/data/china-gis-data">中国 GIS 数据</a></li>
<li><a href="https://github.com/mbloch/mapshaper">mapshaper</a></li>
<li><a href="http://extra.amcharts.com/mapparser3/">amMap parser</a></li>
<li><a href="https://github.com/mbloch/mapshaper/issues/199">Additional attribute for SVG output #199</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: <a href="mailto:l-yanlei@hotmail.com">Spike Leung</a></p>
<p class="date">Date: 2021-08-14 Sat 00:00</p>
<p class="license">License: <a href="https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans">CC BY-NC 4.0</a></p>
<script src="https://utteranc.es/client.js" repo="Spike-Leung/taxodium" issue-term="pathname" theme="github-light" crossorigin="anonymous" async></script>
</div>
</body>
</html>
